Tekla Open API Reference for Tekla Structures 2025
TextElement Constructor (String, FontAttributes)
 Creates a new text element instance with the given textual value and font.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TextElement(
	string Text,
	FontAttributes Font
)
Public Sub New (
	Text As String,
	Font As FontAttributes
)
Parameters
Text
Type: System.String
The textual value to be used.
Font
Type: Tekla.Structures.Drawing.FontAttributes
The font to be used.
See Also
Reference
TextElement Class
TextElement Overload
Tekla.Structures.Drawing Namespace